STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Thread/Thread_Coap_Generic_ThreadX/Core/Src/app_entry.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
  * File Name          : app_entry.c
  * Description        : Entry application source file for STM32WPAN Middleware.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "main.h"
#include "app_entry.h"
#include "app_thread.h"
#include "app_conf.h"
#include "hw_conf.h"
#include "tx_api.h"
#include "stm_logging.h"
#include "shci_tl.h"
#include "stm32_lpm.h"
#include "dbg_trace.h"
#include "shci.h"
#include "otp.h"
#include "advanced_memory_manager.h"
#include "stm32_mm.h"
#include "tx_api.h"

/* Private includes -----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
extern RTC_HandleTypeDef hrtc;
typedef __PACKED_STRUCT
{
  uint32_t *next;
  uint32_t *prev;
} TraceEltHeader_t;
typedef __PACKED_STRUCT
{
  uint8_t   buffer[255];
  uint32_t  size;
} TraceElt_t;
typedef struct __attribute__((packed, aligned(4)))
{
  TraceEltHeader_t header;
  TraceElt_t trace;
} TraceEltPacket_t;
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
/* POOL_SIZE = 2(TL_PacketHeader_t) + 258 (3(TL_EVT_HDR_SIZE) + 255(Payload size)) */
#define POOL_SIZE (CFG_TL_EVT_QUEUE_LENGTH * 4U * DIVC((sizeof(TL_PacketHeader_t) + TL_EVENT_FRAME_SIZE), 4U))
#define POOL_TRACE_SIZE  CFG_AMM_VIRTUAL_APP_TRACE_BUFFER_SIZE + CFG_AMM_VIRTUAL_MEMORY_NUMBER * AMM_VIRTUAL_INFO_ELEMENT_SIZE
#define TX_APP_MEM_POOL_SIZE                     (1024*24)

#define AMM_BCKGND_TASK_STACK_SIZE    (256*7)
#define AMM_BCKGND_TASK_PRIO          (9)
#define AMM_BCKGND_TASK_PREEM_TRES    (0)
#define TRC_BCKGND_TASK_STACK_SIZE    (256*7)
#define TRC_BCKGND_TASK_PRIO          (9)
#define TRC_BCKGND_TASK_PREEM_TRES    (0)
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t EvtPool[POOL_SIZE];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t SystemCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t SystemSpareEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
uint8_t g_ot_notification_allowed = 0U;
static tListNode TraceBufferList;
static uint32_t TracePool[POOL_TRACE_SIZE];
TX_THREAD TRC_BCKGND_Thread;
TX_SEMAPHORE TRC_BCKGND_Thread_Sem;
TX_THREAD AMM_BCKGND_Thread;
TX_SEMAPHORE AMM_BCKGND_Thread_Sem;

static AMM_VirtualMemoryConfig_t vmConfig[CFG_AMM_VIRTUAL_MEMORY_NUMBER] = {
  /* Virtual Memory #1 */
  { 
    .Id = CFG_AMM_VIRTUAL_APP_TRACE,  
    .BufferSize = CFG_AMM_VIRTUAL_APP_TRACE_BUFFER_SIZE
  }
};

static AMM_InitParameters_t ammInitConfig =
{
  .p_PoolAddr = TracePool,
  .PoolSize = POOL_TRACE_SIZE,
  .VirtualMemoryNumber = CFG_AMM_VIRTUAL_MEMORY_NUMBER,
  .p_VirtualMemoryConfigList = vmConfig
};

CHAR * pStack;

/* USER CODE BEGIN PV */
static UCHAR memory_area[DEMO_BYTE_POOL_SIZE];
/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/
CHAR                * pointer = TX_NULL;
TX_MUTEX            MtxShciId;
TX_SEMAPHORE        SemShciId;
TX_SEMAPHORE        SemShciNotify;
TX_THREAD           ShciUserEvtProcessId;
static TX_BYTE_POOL byte_pool_shci;

/* Global function prototypes -----------------------------------------------*/
#if (CFG_DEBUG_TRACE != 0)
size_t DbgTraceWrite(int handle, const unsigned char * buf, size_t bufSize);
#endif /* CFG_DEBUG_TRACE != 0 */

/* USER CODE BEGIN GFP */

/* USER CODE END GFP */

/* Private functions prototypes-----------------------------------------------*/
static void ShciUserEvtProcess      ( ULONG thread_input );
static void Config_HSE              ( void );
static void Reset_Device            ( void );
#if ( CFG_HW_RESET_BY_FW == 1 )
static void Reset_IPCC              ( void );
static void Reset_BackupDomain      ( void );
#endif /* CFG_HW_RESET_BY_FW == 1*/
static void System_Init             ( void );
static void SystemPower_Config      ( void );
static void Init_Debug              ( void );
static void appe_Tl_Init            ( void );
static void APPE_SysStatusNot       ( SHCI_TL_CmdStatus_t status );
static void APPE_SysUserEvtRx       ( void * pPayload );
static void APPE_SysEvtReadyProcessing  ( void );
static void APPE_SysEvtError        ( SCHI_SystemErrCode_t ErrorCode );

#if (CFG_HW_LPUART1_ENABLED == 1)
extern void MX_LPUART1_UART_Init    ( void );
#endif /* CFG_HW_LPUART1_ENABLED == 1 */
#if (CFG_HW_USART1_ENABLED == 1)
extern void MX_USART1_UART_Init     ( void );
#endif /* CFG_HW_USART1_ENABLED == 1 */
static void Init_Rtc                ( void );

/* USER CODE BEGIN PFP */
static void Led_Init                ( void );
static void Button_Init             ( void );

/* Section specific to button management using UART */
static void RxUART_Init(void);
static void RxCpltCallback(void);
static void UartCmdExecute(void);

#define C_SIZE_CMD_STRING       256U
#define RX_BUFFER_SIZE          8U

static uint8_t aRxBuffer[RX_BUFFER_SIZE];
static uint8_t CommandString[C_SIZE_CMD_STRING];
static uint16_t indexReceiveChar = 0;
EXTI_HandleTypeDef exti_handle;
#if(CFG_DEBUG_TRACE != 0)
static void writeTrace(char * buffer, uint32_t size);
#endif
static void TRC_BackgroundProcess(void);
static void AMM_WrapperInit (uint32_t * const p_PoolAddr, const uint32_t PoolSize);
static uint32_t * AMM_WrapperAllocate (const uint32_t BufferSize);
static void AMM_WrapperFree (uint32_t * const p_BufferAddr);
static void AMM_BackgroundProcess_Entry(unsigned long thread_input);
static void TRC_BackgroundProcess_Entry(unsigned long thread_input);

/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void MX_APPE_Config( void )
{
  /**
   * The OPTVERR flag is wrongly set at power on
   * It shall be cleared before using any HAL_FLASH_xxx() api
   */
  __HAL_FLASH_CLEAR_FLAG( FLASH_FLAG_OPTVERR );

  /**
   * Reset some configurations so that the system behave in the same way
   * when either out of nReset or Power On
   */
  Reset_Device();

  /* Configure HSE Tuning */
  Config_HSE();

  return;
}

void MX_APPE_Init( void )
{
  System_Init();       /**< System initialization */

  SystemPower_Config(); /**< Configure the system Power Mode */
  
  AMM_Init (&ammInitConfig);
  
  LST_init_head (&TraceBufferList); 
  
  HW_TS_Init(hw_ts_InitMode_Full, &hrtc); /**< Initialize the TimerServer */

