STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Thread/Thread_Coap_Generic_ThreadX/Core/Src/app_entry.c
static void RxCpltCallback(void)
{
  char buffer[255];
  uint32_t sizeReceived = 9;
#ifdef TX_LOW_POWER
  APP_THREAD_ThreadX_LowPowerEnable(0);
#endif // TX_LOW_POWER
  /* Filling buffer and wait for '\r' char */
  if (indexReceiveChar < C_SIZE_CMD_STRING)
  {
    if (aRxBuffer[0] == '\r')
    {
      strcpy(buffer, "received ");
      strcat(buffer, (const char *)CommandString);
      buffer[sizeReceived + indexReceiveChar] = '\n';
      writeTrace(buffer, sizeReceived + indexReceiveChar + 1);
#ifdef TX_LOW_POWER        
      APP_THREAD_ThreadX_LowPowerEnable(1);
#endif // TX_LOW_POWER
      UartCmdExecute();

      /* Clear receive buffer and character counter*/
      indexReceiveChar = 0;
      memset(CommandString, 0, C_SIZE_CMD_STRING);
    }
    else
    {
      CommandString[indexReceiveChar++] = aRxBuffer[0];
    }
  }

  /* Once a character has been sent, put back the device in reception mode */
  HW_UART_Receive_IT(CFG_DEBUG_TRACE_UART, aRxBuffer, 1U, RxCpltCallback);
}

static void UartCmdExecute(void)
{
  uint8_t size = 7; /* size of "SWX OK\n" msg*/
  /* Parse received CommandString */
  if(strcmp((char const*)CommandString, "SW1") == 0)
  {
    writeTrace("SW1 OK\n", size);
    exti_handle.Line = EXTI_LINE_4;
    HAL_EXTI_GenerateSWI(&exti_handle);
  }
  else if (strcmp((char const*)CommandString, "SW2") == 0)
  {
    writeTrace("SW2 OK\n", size);
    exti_handle.Line = EXTI_LINE_0;
    HAL_EXTI_GenerateSWI(&exti_handle);
  }
  else if (strcmp((char const*)CommandString, "SW3") == 0)
  {
    writeTrace("SW3 OK\n", size);
    exti_handle.Line = EXTI_LINE_1;
    HAL_EXTI_GenerateSWI(&exti_handle);
  }
  else
  {
    APP_DBG("NOT RECOGNIZED COMMAND : %s", CommandString);
  }
}
/* USER CODE END FD_WRAP_FUNCTIONS */
